NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54lc10a/nrf54lc10a_flpr.svd
          <register>
            <name>LFSRSEED</name>
            <description>LFSR seed register.</description>
            <addressOffset>0x02C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00FFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LFSRSEED</name>
                <description>LFSR initialization value.</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>LFSRSSELECTION</name>
                <description>Share index for which initialization value should be used.</description>
                <lsb>24</lsb>
                <msb>25</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS</name>
            <description>Status register.</description>
            <addressOffset>0x030</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TESTDATABUSY</name>
                <description>High when data written to TestData register is being processed.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>STATE</name>
                <description>State of the control FSM:</description>
                <lsb>1</lsb>
                <msb>3</msb>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>RESET</name>
                    <description>Reset</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>STARTUP</name>
                    <description>Startup</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>IDLERON</name>
                    <description>Idle / FIFO full</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FILLFIFO</name>
                    <description>Fill FIFO</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ERROR</name>
                    <description>Error</description>
                    <value>0x5</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>REPFAIL</name>
                <description>NIST repetition test(s) failure.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PROPFAIL</name>
                <description>NIST proportion test(s) failure.</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ANYHEALTHTESTFAIL</name>
                <description>Any of the enabled health tests is failing.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              </field>
              <field>
                <name>FULLINT</name>
                <description>FIFO full status.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>STARTUPFAIL</name>
                <description>Start-up test(s) failure.</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              </field>
              <field>
                <name>REPTESTFAILPERSHARE</name>
                <description>NIST Repetition test failure per share.</description>
                <lsb>12</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PROPTESTFAILPERSHARE</name>
                <description>NIST Proportion test failure per share.</description>
                <lsb>16</lsb>
                <msb>19</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CONDITIONINGISTOOSLOW</name>
                <description>Conditioning consumes data slower than they are provided to it.</description>
                <lsb>20</lsb>
                <msb>20</msb>
                <modifiedWriteValues>zeroToClear</modifiedWriteValues>
              </field>
            </fields>
          </register>
          <register>
            <name>WARMUPPERIOD</name>
            <description>Number of clock cycles in warm-up sequence.</description>
            <addressOffset>0x034</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000200</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>WARMUPPERIOD</name>
                <description>Number of clock cycles in warm-up sequence.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DISABLEOSC</name>
            <description>DisableOsc register.</description>
            <addressOffset>0x038</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DISABLEOSC</name>
                <description>Disable oscillator rings.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SAMPLINGPERIOD</name>
            <description>Number of clock cycles between sampling moments.</description>
            <addressOffset>0x044</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000FFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SAMPLINGPERIOD</name>
                <description>Number of clock cycles between sampling moments.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>HWCONFIG</name>
            <description>Hardware configuration register.</description>
            <addressOffset>0x058</addressOffset>
            <access>read-write</access>
            <resetValue>0x0002411B</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>NBOFINV</name>
                <description>Generic g_NbOfInverters value.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LOG2NBOFAUTOCORRTESTSPERSHARE</name>
                <description>Generic g_Log2NbOfAutoCorrTestsPerShare value.</description>
                <lsb>8</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LOG2FIFODEPTH</name>
                <description>Generic g_Log2FifoDepth value.</description>
                <lsb>12</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>LOG2NBOFSHARES</name>
                <description>Generic g_Log2NbOfShares value.</description>
                <lsb>16</lsb>
                <msb>17</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>COOLDOWNPERIOD</name>
            <description>Number of clock cycles in cool-down sequence.</description>
            <addressOffset>0x05C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>COOLDOWNPERIOD</name>
                <description>Number of clock cycles in cool-down sequence.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AUTOCORRTESTCUTOFF0</name>
            <description>AutoCorrTestCutoff register 0</description>
            <addressOffset>0x060</addressOffset>
            <access>read-write</access>
            <resetValue>0x007F007F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DLYZEROCUTOFF</name>
                <description>Auto-correlation test cut-off value for delay of 0 samples.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>DLYONECUTOFF</name>
                <description>Auto-correlation test cut-off value for delay of +1 sample.</description>
                <lsb>16</lsb>
                <msb>22</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AUTOCORRTESTCUTOFF1</name>
            <description>AutoCorrTestCutoff register 1</description>
            <addressOffset>0x064</addressOffset>
            <access>read-write</access>
            <resetValue>0x007F007F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DLYTWOCUTOFF</name>
                <description>Auto-correlation test cut-off value for delay of +2 samples.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>DLYTHREECUTOFF</name>
                <description>Auto-correlation test cut-off value for delay of +3 samples.</description>
                <lsb>16</lsb>
                <msb>22</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CORRTESTCUTOFF0</name>
            <description>CorrTestCutoff register 0</description>
            <addressOffset>0x068</addressOffset>
            <access>read-write</access>
            <resetValue>0x007F007F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DLYZEROCUTOFF</name>
                <description>Correlation test cut-off value for delay of 0 samples.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>DLYONECUTOFF</name>
                <description>Correlation test cut-off value for delay of +/-1 sample.</description>
                <lsb>16</lsb>
                <msb>22</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CORRTESTCUTOFF1</name>
            <description>CorrTestCutoff register 1</description>
            <addressOffset>0x06C</addressOffset>
            <access>read-write</access>
            <resetValue>0x007F007F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DLYTWOCUTOFF</name>
                <description>Correlation test cut-off value for delay of +/- 2 samples.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>DLYTHREECUTOFF</name>
                <description>Correlation test cut-off value for delay of +/- 3 samples.</description>
                <lsb>16</lsb>
                <msb>22</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AUTOCORRTESTFAILED</name>
            <description>Auto-correlation test failing ring(s).</description>
            <addressOffset>0x070</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AUTOCORRTESTFAILED</name>
                <description>Auto-correlation test failing ring(s).</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CORRTESTFAILED</name>
            <description>Correlation test failing ring.</description>
            <addressOffset>0x074</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CORRTESTFAILED</name>
                <description>Correlation test failing ring.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HWVERSION</name>
            <description>Fixed to 1 for this version.</description>
            <addressOffset>0x07C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>HWVERSION</name>
                <description>Fixed to 1 for this version.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x20</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>FIFO[%s]</name>
            <description>Description collection: FIFO data</description>
            <addressOffset>0x080</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATA</name>
                <description>FIFO data</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>PK</name>
          <description>Unspecified</description>
          <headerStructName>CRACENCORE_PK</headerStructName>
          <access>read-write</access>
          <addressOffset>0x2000</addressOffset>
          <register>
            <name>POINTERS</name>
            <description>Pointers register.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OPPTRA</name>
                <description>When executing primitive arithmetic operations, this pointer defines where operand A is located in memory (location 0x0 to 0xF).</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>OPPTRB</name>
                <description>When executing primitive arithmetic operations, this pointer defines where operand B is located in memory (location 0x0 to 0xF).</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>OPPTRC</name>
                <description>When executing primitive arithmetic operations, this pointer defines the location (0x0 to 0xF) where the result will be stored in memory.</description>
                <lsb>16</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>OPPTRN</name>
                <description>When executing primitive arithmetic operations, this pointer defines the location where the modulus is located in memory (location 0x0 to 0xF).</description>
                <lsb>24</lsb>
                <msb>27</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>COMMAND</name>
            <description>Command register.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x0000000F</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OPEADDR</name>
                <description>This field defines the operation to be performed.</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>FIELDF</name>
                <description>0: Field is GF(p) 1: Field is GF(2**m)</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>OPBYTESM1</name>
                <description>This field defines the size (= number of bytes minus one) of the operands for the current operation.</description>
                <lsb>8</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>RANDMOD</name>
                <description>Enable randomization of modulus (counter-measure).</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>SELCURVE</name>
                <description>Enable accelerator for specific curve modulus:</description>
                <lsb>20</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NOACCEL</name>
                    <description>Unspecified</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>P256</name>
                    <description>Unspecified</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>P384</name>
                    <description>Unspecified</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>P521</name>
                    <description>Unspecified</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>P192</name>
                    <description>Unspecified</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CURVE25519</name>
                    <description>Unspecified</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ED25519</name>
                    <description>Unspecified</description>
                    <value>0x6</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RANDKE</name>
                <description>Enable randomization of exponent/scalar (counter-measure).</description>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>RANDPROJ</name>
                <description>Enable randomization of projective coordinates (counter-measure).</description>
                <lsb>25</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>EDWARDS</name>
                <description>Enable Edwards curve.</description>
                <lsb>26</lsb>
                <msb>26</msb>
              </field>
              <field>
                <name>SWAPBYTES</name>
                <description>Swap the bytes on AHB interface:</description>
                <lsb>28</lsb>
                <msb>28</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NATIVE</name>
                    <description>Native format (little endian).</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SWAPPED</name>
                    <description>Byte swapped (big endian).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>FLAGA</name>
                <description>Flag A.</description>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>FLAGB</name>
                <description>Flag B.</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>CALCR2</name>
                <description>This bit indicates if the IP has to calculate R**2 mod N for the next operation.</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NRECALCULATE</name>
                    <description>don't recalculate R² mod N</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RECALCULATE</name>
                    <description>re-calculate R² mod N</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CONTROL</name>
            <description>Command register.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>START</name>
                <description>Writing a 1 starts the processing.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>CLEARIRQ</name>
                <description>Writing a 1 clears the IRQ output.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
